УТ_для_edt/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГруппаПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПодразделениеПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет предопределенные параметры
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЭлементОбъект = Справочники.CRM_УчетныеЗаписиМессенджеров.СистемаВзаимодействия.ПолучитьОбъект();
	ЭлементОбъект.ТипМессенджера = "СистемаВзаимодействия";
	ЭлементОбъект.Наименование = НСтр("ru = 'Обсуждение'");
	ЭлементОбъект.Записать();
	
	ЭлементОбъект = Справочники.CRM_УчетныеЗаписиМессенджеров.B2BПортал.ПолучитьОбъект();
	ЭлементОбъект.ТипМессенджера = "B2BПортал";
	ЭлементОбъект.Наименование = НСтр("ru = 'B2B портал'");
	ЭлементОбъект.Записать();
	
КонецПроцедуры

#Область ПереходНаНовуюВерсию

// Процедура-обработчик регистрации данных к обработке для перехода на версию 3.1.24.6
//
// Параметры:
//  Параметры	 - Структура	 - Параметры
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаВерсию_3_1_24_6(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|ГДЕ
	|	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = ""WhatsApp""
	|	И CRM_УчетныеЗаписиМессенджеров.Включена";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	МассивКОбработке = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметровДоступа =
			CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(ВыборкаДетальныеЗаписи.Ссылка);
		
		Если СтруктураПараметровДоступа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураПараметровДоступа.Свойство("Провайдер") И СтруктураПараметровДоступа.Провайдер = 1 Тогда
			МассивКОбработке.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивКОбработке);
	
КонецПроцедуры

// Процедура выполняет обработку данных для перехода на версию 3.1.24.6
//
// Параметры:
//  Параметры	 - Структура	 - Параметры.
//
Процедура ОбработатьДанныеДляПереходаНаВерсию_3_1_24_6(Параметры) Экспорт
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь,
		 "Справочник.CRM_УчетныеЗаписиМессенджеров");
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = "";
		Попытка
			СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(Выборка.Ссылка);
			Если УстановитьWebhookGreen(Выборка.Ссылка, СтруктураПараметровДоступа, ТекстОшибки) Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				ОбъектовОбработано = ОбъектовОбработано + 1;
			Иначе
				ВызватьИсключение "GreenApi: настройки не сохранены";
			КонецЕсли;
			
		Исключение
			// Если не удалось обработать объект, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			Если Не ПустаяСтрока(ТекстОшибки) Тогда // не удалось записать настройки учетной записи на стороне сервера green api
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;                                                                             
			
			ТекстОшибки = ?(ПустаяСтрока(ТекстОшибки), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ТекстОшибки);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать учетную запись мессенджера: %1 по причине:
					|%2'"), 
					Выборка.Ссылка, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				 УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.CRM_УчетныеЗаписиМессенджеров, Выборка.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь,
		 "Справочник.CRM_УчетныеЗаписиМессенджеров");
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре CRM_УчетныеЗаписиМессенджеров.ОбработатьДанныеДляПереходаНаВерсию_3_1_24_6 не удалось обработать некоторые объекты (пропущены): %1'"), 
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			 УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.CRM_УчетныеЗаписиМессенджеров, ,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Процедура CRM_УчетныеЗаписиМессенджеров.ОбработатьДанныеДляПереходаНаВерсию_3_1_24_6 обработала очередную порцию объектов: %1'"),
					ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает Истина, если удалось установить Webhook Green.
//
// Параметры:
//  УчетнаяЗапись				 - СправочинкСсылка.CRM_УчетныеЗаписиМессенджеров	 - Учетная запись.
//  СтруктураПараметровДоступа	 - Структура										 - Структура параметров.
//  ТекстОшибки					 - Строка											 - Текст ошибки.
// 
// Возвращаемое значение:
//   - Булево
//
Функция УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа, ТекстОшибки = "") Экспорт
	
	Если ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
		АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
		АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/") 
			+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
	Иначе
		АдресWebhook = "";
	КонецЕсли;
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("webhookUrl", АдресWebhook);
	СтруктураНастроек.Вставить("incomingWebhook", "yes");
	СтруктураНастроек.Вставить("outgoingWebhook", "yes");
	СтруктураНастроек.Вставить("deviceWebhook", "yes");
	СтруктураНастроек.Вставить("stateWebhook", "yes");
	СтруктураНастроек.Вставить("markIncomingMessagesReaded", "no");
	СтруктураНастроек.Вставить("outgoingMessageWebhook", "yes");
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(СтруктураНастроек, Истина);
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Обработки.CRM_РаботаСМессенджеромWhatsApp.СерверGreen(),
		 СтрокаЗапроса
		, Обработки.CRM_РаботаСМессенджеромWhatsApp.URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "setSettings"), СтруктураПараметровДоступа.ПараметрыПрокси));
		
	Если СтруктураОтвета.Свойство("saveSettings")	Тогда
		Возврат СтруктураОтвета.saveSettings;
	Иначе       
		ТекстОшибки = (?(СтруктураОтвета.Свойство("error"), "Не удалось сохранить настройки по причине : " + СтруктураОтвета.error,
			 "Не удалось сохранить настройки!"));
		//ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
